[
  {
    "title": "Type 2 Diabetes Mellitus Clinical Overview",
    "content": "Type 2 diabetes mellitus (T2DM) is a chronic metabolic disorder characterized by insulin resistance and progressive beta-cell dysfunction. It affects approximately 90-95% of all diabetes cases. The condition develops when the body becomes resistant to insulin or when the pancreas cannot produce enough insulin to maintain normal glucose levels. Risk factors include obesity, sedentary lifestyle, family history, age >45 years, and certain ethnic backgrounds (Hispanic, African American, Native American, Asian American). The pathophysiology involves multiple mechanisms including hepatic glucose overproduction, impaired glucose uptake by muscle and fat tissues, and progressive beta-cell failure. Early stages may be asymptomatic, making screening important for high-risk individuals. Classic symptoms include polyuria, polydipsia, polyphagia, unexplained weight loss, fatigue, and blurred vision. Diagnosis is made through fasting plasma glucose ≥126 mg/dL, 2-hour plasma glucose ≥200 mg/dL during OGTT, HbA1c ≥6.5%, or random plasma glucose ≥200 mg/dL with symptoms.",
    "specialty": "endocrinology",
    "authors": ["Dr. Sarah Johnson", "Dr. Michael Chen"],
    "keywords": ["diabetes", "insulin resistance", "glucose", "metabolism", "endocrine"],
    "credibility_score": 0.95
  },
  {
    "title": "Diabetes Management and Treatment Goals",
    "content": "Effective diabetes management requires a comprehensive approach addressing glycemic control, cardiovascular risk reduction, and complication prevention. The primary goal is achieving and maintaining target HbA1c levels: <7% for most adults, <6.5% for healthy individuals with long life expectancy, and <8% for older adults with comorbidities. Treatment strategies include lifestyle modifications (medical nutrition therapy, physical activity, weight management) and pharmacological interventions. First-line medication is typically metformin, which reduces hepatic glucose production and improves insulin sensitivity. Additional medications include sulfonylureas, SGLT-2 inhibitors, GLP-1 receptor agonists, DPP-4 inhibitors, and insulin. Patient education is crucial, covering self-monitoring of blood glucose, medication adherence, recognition of hypoglycemia, proper foot care, and when to seek medical attention. Regular monitoring includes quarterly HbA1c testing, annual comprehensive foot exams, annual dilated eye exams, and screening for diabetic nephropathy. Blood pressure control (<140/90 mmHg, <130/80 mmHg in younger patients) and lipid management are essential for cardiovascular risk reduction.",
    "specialty": "endocrinology",
    "authors": ["Dr. Sarah Johnson", "Dr. Robert Martinez"],
    "keywords": ["diabetes management", "HbA1c", "metformin", "blood glucose", "lifestyle"],
    "credibility_score": 0.94
  },
  {
    "title": "Diabetic Complications and Prevention",
    "content": "Diabetes complications are classified as microvascular (affecting small blood vessels) and macrovascular (affecting large blood vessels). Microvascular complications include diabetic retinopathy (leading cause of blindness in working-age adults), diabetic nephropathy (leading cause of end-stage renal disease), and diabetic neuropathy (affecting up to 50% of diabetic patients). Macrovascular complications include coronary artery disease, stroke, and peripheral arterial disease. The pathophysiology involves chronic hyperglycemia leading to advanced glycation end products (AGEs), oxidative stress, and inflammation. Prevention strategies focus on optimal glycemic control, blood pressure management, lipid control, and smoking cessation. Diabetic retinopathy screening should begin at diagnosis and continue annually. Diabetic nephropathy screening involves annual measurement of serum creatinine, estimated GFR, and urine albumin-to-creatinine ratio. Neuropathy screening includes annual comprehensive foot examinations with monofilament testing and vibration sensation assessment. Early detection and intervention can significantly reduce the risk of progression and improve patient outcomes.",
    "specialty": "endocrinology",
    "authors": ["Dr. Lisa Wang", "Dr. David Thompson"],
    "keywords": ["diabetic complications", "retinopathy", "nephropathy", "neuropathy", "screening"],
    "credibility_score": 0.93
  }
]
